Repository: nadavoid/ReadySiteBase
Catalog: sites/all/modules/filefield_insert/translations/*.po
Languages: nl

source: Image size
nl: Fotoafmeting

source: Send to text area
nl: Stuur naar tekstveld

source: This hidden element will be replaced with the FileField Insert element.
nl: De verborgen elemten zullen worden vervangen met het 'Voeg Bestandsveld in'-element.

source: HTML insert
nl: HTML-invoegen

source: These options allow the user to easily insert an &lt;a&gt; or &lt;img&gt; tag into text areas or WYSIWYG editors after uploading a file or image.
nl: Deze opties laten de gebruiker gemakkelijk een &lt;a&gt;- of &lt;img&gt;-tag toevoegen aan een tekstveld of WYSIWYG-editorveld na het uploaden van een foto.

source: Enable HTML insert
nl: Sta HTML-invoegen toe

source: Enable the insertion options for this widget.
nl: Zet de invoegopties voor deze widget aan.

source: Enabled ImageCache presets
nl: Bruikbare FotoCache-instellingen

source: Select which ImageCache presets should be available when sending images to text areas. If no presets are selected, the option to use a preset is not displayed.
nl: Selecteer welke FotoCache-instellingen moeten kunnen worden gebruikt tijdens het sturen van foto's naar het tekstveld. Als er geen instellingen zijn geselecteerd zal de opties om een instelling te gebruiken niet worden getoond.

source: Note that only file fields that use the "Image" widget type support ImageCache configuration options.
nl: Merk op dat alleen Bestandvelden die de 'Foto'-widget gebruiken gebruik maken van de FotoCache-configuratieopties.

source: Maximum image insert width
nl: Maximum fotobreedte

source: When inserting images, the height and width of images may be scaled down to fit within the specified width. Note that this does not resize the image, it only affects the HTML output. To resize images it is recommended to install the <a href="http://drupal.org/project/image_resize_filter">Image Resize Filter</a> module.
nl: Tijdens het invoegen van foto's kunnen de hoogte en breedte veranderd worden binnen de opgegeven breedte. Merk op dat dit de afmetingen van de foto niet aanpast, maar slechts de HTML-grootte verandert. Om de fotoafmeting te veranderen is het aan te raden om de <a href="http://drupal.org/project/image_resize_filter">Foto Herschaal Filter</a> module te gebruiken.

source: Original
nl: Origineel

source: FileField Insert
nl: Voeg Bestandsveld in

source: Assists in inserting uploaded files or images into the body field or other text areas.
nl: Helpte met het invoegen van geuploade bestanden of foto's in tekstvelden.
