Repository: nadavoid/ReadySiteBase
Catalog: sites/all/modules/linodef/translations/linodef.*.po
Languages: de

source: Linodef - Link nodes & taxonomy terms and embed field values & term names.
de: Linodef - Verlinkt Nodes & Taxonomiebegriffe und bindet Feldwerte & Begriffsnamen ein.

source: Substitutes the Node ID for the node title or field value & links to this node. Furthermore Linodef substitutes the term ID for the term name & links to the term.
de: Ersetzt die Node ID mit dem Nodetitel oder einem Feldwert und erstellt einen Link zum Node. Darüberhinaus ersetzt Linodef die Begriffs ID mit dem Begriffsnamen und verlinkt den Begriff.

source: Embeds node title or field values by node ID and terms by term ID (<a href="@format-tips-page">[#8], [#8:field_name], [#8:field_name:2], &lt;#8&gt;Your Text&lt;/#8&gt;, [#t8]</a>).
de: Integriert Nodetitel oder Feldwerte mittels Node ID bzw. Taxonomiebegriffe mittels Begriffs ID (<a href="@format-tips-page">[#8], [#8:field_name], [#8:field_name:2], &lt;#8&gt;eigener Text&lt;/#8&gt;, [#t8]</a>).

source: Field
de: Feld

source: Term
de: Begriff

source: Content type
de: Inhaltstyp

source: Vocabulary
de: Vokabular

source: Unknown key %key with value %value for %variable in %function
de: Unbekannter Schlüssel %key mit dem Wert %value für %variable in %function

source: Access to !element denied
de: Zutritt zu !element verweigert

source: !element not found
de: !element nicht gefunden

source: Unknown error type %type for %variable of the first parameter of %function
de: Unbekannter Fehlertyp %type für %variable des ersten Parameters von %function

source: Linodef tag with id %id ignores option %option
de: Der Linodef Tag mit der ID %id ignoriert die Option %option

source: Variable %variable of the first parameter of %function has to be an array with keys %keys
de: Die Variable %variable des ersten Parameters von %function muss ein Array mit den Schlüsseln %keys sein

source: Linodef tag with id %id contains unknown option %option (all options must be written in lower case)
de: Der Linodef Tag mit der ID %id beinhaltet die unbekannte Option %option (alle Optionen müssen kleingeschrieben werden)

source: Install & activate module %module
de: Module %module sollte installiert & aktiviert werden

source: Check value for %variable or ask your site administrator.
de: Wert für %variable überprüfen oder den Administrator der Seite konsultieren

source: Supported fields must store a (single or multiple) value such as textfields & datefield (from date).
de: Linodef unterstützt Felder (unbegrenzte Anzahl an Werten möglich) die einen Wert zurückgeben, wie Textfelder und Datumsfelder (Startdatum).

source: Parameter %variable of %function has to be an array.
de: Der Parameter der %variable von %function muss ein Array sein

source: Adjust settings for Linodef
de: Einstellungen für Linodef anpassen

source: Provides tags for internal node and term links based on their ID and dynamically embeds node titles, field values and term names
de: Stellt Tags für interne Node und Begriffsverlinkung auf Basis ihrer ID zur Verfügung und integriert Nodetitel, Feldwerte und Begriffsnamen dynamisch.

source: %Linodef is a filter for internal links. It uses a simple but unique markup so %Linodef doesn't interfere with other filter modules.
de: %Linodef ist ein Filter für interne Links. Er nutzt eine einfache aber eindeutige Textauszeichnung, so dass %Linodef andere Filtermodule nicht störend beeinflusst.

source: The ID of a node or of a taxonomy term and optionally a fieldname are the solely elements stored in your text. One advantage of this method in comparison to similar filter modules is the fact that the links don't break if you change the node title or term name. Furthermore, if you change the title of the node or the value of a field or the name of a term then those are automatically updated in your text, too.
de: Die ID eines Nodes oder eines Taxonomiebegriffs und optional ein Feldname sind die einzigen Elemente, die im Text gespeichert werden. Ein Vorteil dieser Methode im Verlgeich zu anderen Filtermodulen ist die Tatsache, dass die Links auch im Falle einer Änderung des Nodetitels oder Begriffsnamens gültig bleiben.

source: Embed elements
de: Element einbinden

source: To embed elements into your text, prepend the element ID with the hash key # and surround them by brackets []: [#ID]. That way a node title is inserted and linked. To embed the content of a field, add the field name: [#ID:field_name]. Moreover it is possible to add a field value number in the case you have a field with multiple values and want to use a different value than the first: [#ID:field_name:number].
de: Zur Einbindung von Elementen in Texte muss vor der Element ID die Raute # stehen und beides von rechteckigen Klammern eingerahmt sein: [#ID]. Auf diese Weise wird eine Nodetitel eingebunden und verlinkt. Um den Inhalt eines Feldes einzubinden, muss der Feldname hinzugefügt werden: [#ID:field_name]. Weiterhin ist es möglich, bei einem Feld mit mehreren Werten, den genauen Feldwert anzugeben: [#ID:field_name:zahl].

source: The syntax is as following:
de: Die Syntax lautet:

source: Embed node title and link to the node.
de: Integriert Nodetitel und verlinkt zum Node.

source: node title
de: Nodetitel

source: Embed field value and link to the node.
de: Integriert Feldwert und verlinkt zugehörigen Node.

source: field value
de: Feldwert

source: certain field value of a multiple values field
de: bestimmter Feldwert eines Feldes mit mehreren Werten

source: Example for nodes and fields
de: Beispiel für Nodes und Felder

source: We have a node with id=!id and a title %title. It contains a multiple value field called !firstnames. The first value is %value1, second is %value2. Note that the field value numbers start at 0, so first value has number &quot;0&quot;, second has number &quot;1&quot; etc. If the node has a path alias then the link contains this instead of the default drupal path (the examples are limited to the default paths).
de: Gegeben ist ein Node mit der id=!id sowie dem Titel %title. Er enthält ein Feld mit mehreren Werten und dem Feldnamen !firstnames. Der erste Wert lautet %value1, der zweite %value2. Zu beachten ist, dass die Nummern für die Feldwerte mit 0 beginnen, so dass der erste Wert die Nummer "0" besitzt, der zweite hat die Nummer "1" usw. Falls dem Node ein lesbarer Pfad zugeordnet ist, dann wird dieser anstatt des standardmäßigen Drupalpfades genutzt (die folgende Beispiele sind auf die Standardpfade beschränkt).

source: Alter embedding by tag options
de: Alternative Einbindungen durch Optionen

source: Options can modify the ID type and the embed method. They are entered right after the ID or the field settings and are separated by a comma. The number of options a tag can have is not limited.
de: Optionen können die Art der ID sowie die Einbundungsmethode modifizieren. Sie werden direkt nach der ID oder der Feldeinstellungen eingegeben und durch ein Komma abgetrennt. Die Anzahl an Optionen innerhalb eines Tags ist unbegrenzt.

source: Embed an element with options.
de: Einbindung eines Elements mit Optionen.

source: Depends on the options used.
de: Abhängig von den verwendeten Optionen.

source: Embed a field value with options.
de: Einbinden eines Feldwertes mit Optionen.

source: Embed a certain field value with options.
de: Einbinden eines bestimmten Feldwertes mit Optionen.

source: Example for ID type and embed modification options
de: Beispiel für ID Varianten und Modifikationen der Einbindung

source: Here we use the embed modification option "nolink" to have an output without a link to the element and the ID type option "tid" to embed a taxonomy term instead of a node. The taxonomy term has the id=!id and the name %termname. If the term has a path alias then the link contains this instead of the default drupal path (the example is limited to the default path). Furthermore we have a node (optional option "nid") with id=!id and the title %nodetitle.
de: In diesem Beispiel wird die Modifikation "nolink" benutzt, um die Ausgabe nicht zu verlinken; sowie die ID Variante "tid", um einen Taxonomiebegriff anstatt eines Nodes einzubetten. Der Taxonomiebegriff hat die ID=!id und den Namen %termname. Falls dem Begriff ein lesbarer Pfad zugeordnet ist, so wird dieser anstelle des standardmäßigen Drupalpfades genutzt (die folgenden Beispiele sind auf die Standardpfade begrenzt). Weiterhin gibt es einen Node (optionale ID Variante "nid") mit der ID=!id und dem Titel %nodetitle.

source: Use comments to flag your tags for editors
de: Kommentare zur Kennzeichnung der Tags für Bearbeiter

source: Comments act as an indicator for Linodef tags, to describe your tag for yourself or other editors. A comment can be inserted inside the tag prepended with a space and it may consist of all UTF-8 characters except the closing bracket ].
de: Kommentare dienen zur Kennzeichnung von Linodef Tags, zur Beschreibung des Tags für alle Bearbeiter. Ein Kommentar kann innerhalb des Tags eingefügt werden. Dazu braucht lediglich ein Leerzeichen vorangestellt zu sein. Er darf alle UTF-8 Zeichen bis auf die schließende, eckige Klammer ] enthalten.

source: Comments are visible only during editing and never appear by viewing a text. The nature of comments is that they must not modified automatically and therefore will not change unless you change it. This is important to understand since the content the tag displays can change automatically and so the comment may be outdated. So try to use a common description.
de: Kommentare sind nur während des Bearbeitens sichtbar und tauchen niemals beim Anschauen eines Textes auf. Üblicherweise werden Kommentare nicht automatisch aktualisiert. Hingegen kann der Inhalt, den ein Tag darstellt, automatisch geändert werden, so dass dann der Kommentar vielleicht nicht mehr zutreffend ist. Deshalb sind allgemein gehaltene Kommentare zu bevorzugen.

source: Use comments to give information about the tag during editing.
de: Kommentare zur Tag-Kennzeichnnung während des Bearbeitens nutzen.

source: Comment a field content.
de: Kommentieren eines Feldinhaltes.

source: Comments work together with options.
de: Kommentare funktionieren zusammen mit Optionen.

source: Create node links with own linktext
de: Links zu Nodes mit eigenem Linktext erstellen

source: your Text
de: eigener Text

source: Example
de: Beispiel

source: Tag Description
de: Tag-Beschreibung

source: You Type
de: Eingegeben

source: You Get
de: Ergebnis

source: since a fieldname is set and therefore the node ID is used instead of the term ID
de: da der Feldname gesetzt ist und daher die Node ID anstatt der Begriffs ID genutzt wird

source: since a taxonomy term does not use content translation
de: weil ein Taxonomiebegriff keine Übersetzung nutzt.

source: Enter a further option for Linodef tag with id %id or remove the last comma inside the tag
de: Einen weitere Option zum Linodef Tag mit der ID %id hinzufügen oder das letzte Komma innerhalb des Tags entfernen

source: Enter an option for Linodef tag with id %id or remove the comma inside the tag
de: Eine Option zum Linodef tag mit der ID %id hinzufügen oder das Komma innerhalb des Tags entfernen

source: desired to linking %usertext
de: gedacht, um %usertext zu verlinken

source: to use the option %option of Linodef tag with id %nid
de: zur Nutzung der Option %option im Linodef Tag mit der ID %nid

source: Field %field of node %nid has no content and hence cannot be embedded. Create content for that field or revise the Linodef tag which contains %erroneous_tag
de: Das Feld %field des Nodes %nid hat keinen Inhalt und kann daher nicht eingebunden werden. Entweder etwas in dieses Feld schreiben oder den Linodef Tag mit dem Inhalt %erroneous_tag überarbeiten

source: Value %valuenumber of field %field of node %nid not found or has no content and hence cannot be embedded. Create content for that field or revise the Linodef tag which contains %erroneous_tag
de: Der Wert %valuenumber des Feldes %field des Nodes %nid kann nicht gefunden werden oder hat keinen Inhalt. Entweder etwas in dieses Feld schreiben oder den Linodef Tag mit dem Inhalt %erroneous_tag überarbeiten

source: or is not assigned to content type of node %nid
de: oder ist nicht dem Inhaltstyp des Nodes %nid zugewiesen

source: Shows a teaser list of nodes using term @term
de: Zeigt eine Teaserliste von Nodes, die den Begriff @term nutzen

source: Linodef messages
de: Linodef Benachrichtigungen

source: Access denied message
de: Zugriff verweigert Nachricht

source: If the user has no access to an embedded element this message is shown instead of the embedded text.
de: Falls der Benutzer keinen Zugang zu einem eingebundenen Element besitzt, wird diese Nachricht anstatt des Elementes angezeigt.

source: Also this message replaces items in the Linodef elementlist of an editorbutton. This is the case if the user has edit permissions but has no access to certain (or all) items of the list.
de: Desweiteren ersetzt diese Nachricht Einträge in der Linodef Elementliste einer Editorschaltfläche. Dies ist der Fall, wenn der Benutzer zwar Bearbeitungsrechte hat, aber keinen Zugang zu bestimmten (oder allen) Einträgen dieser Liste.

source: !element contains the element type and the element id, e.g. Node 10 or Field field_example. It is recommended to use !element in this message.
de: !element beinhaltet den Elementtypen sowie die Element ID, z.B. Node 10 oder Feld field_example. Die Verwendung von !element innerhalb der Nachricht wird empfohlen.

source: If you have a multilanguage site you have to add the translation for your message manually.
de: Übersetzungen dieser Nachricht müssen manuell erstellt werden.

source: Linodef message location
de: Ort der Linodef Benachrichtigungen

source: Show messages inline
de: Zeige Benachrichtigungen innerhalb des Textes

source: Show page messages
de: Zeige Benachrichtigungen als Seitennachricht

source: The place where the messages appear can be adjusted here: Page messages are displayed with the default drupal message system (messages in the green, yellow or red box).
de: Hier können die Orte ausgewählt werden, an denen Nachrichten erscheinen sollen: Seitennachrichten werden mit dem standardmäßigen Drupal Nachrichtensystem erstellt (Nachrichten in den grünen, gelben oder roten Kästen).

source: Inline messages appear directly in the text and in the Linodef elementlist of an editorbutton.
de: Nachrichten innerhalb des Textes erscheinen direkt auf der Tagposition sowie in der Linodef Elementliste einer Editorschaltfläche.

source: Inline messages appear directly in the text.
de: Nachrichten innerhalb des Textes erscheinen direkt auf der Tagposition.

source: Be careful when deactivating both as it will confuse your editorial staff members and your visitors in case some Linodef tags have a wrong syntax; what could happen since without messages the editor gets no cue when he enters a Linodef tag in a wrong manner. Not to mention that finding the fault might be an exhausting task without helpful hints.
de: Wenn alle Benachrichtigungsorte deaktivert sind, können im Falle des Vorhandenseins fehlerhafter Linodef Tags Bearbeiter und Besucher verwirrt werden. Bei keiner Anzeige von Benachrichtigung ist die Wahrscheinlichkeit für die Entstehung fehlerhafter Linodef Tags erhöht, da der Bearbeiter nicht auf Fehler während der Bearbeitung hingewiesen wird. Darüberhinaus ist die Fehlerfindung ohne helfende Nachrichten extrem mühsam.

source: Linodef message level
de: Linodef Benachrichtigungsschwelle

source: Show all messages
de: Zeige sämtliche Benachrichtigungen

source: Show critical & access messages
de: Zeige nur kritische & Zugriffsbenachrichtigungen

source: Show critical messages only
de: Zeige nur kritische Benachrichtigungen

source: Normal (warning) messages give the user indicators about syntax faults, lacking (optional) modules to enable a feature he tries to use and the decision Linodef has made whereupon. Critical messages show up if the tag cannot be substituted due to lacking elements and access messages in case of denied access.
de: Normale Nachrichten (Warnungsstufe) geben den Benutzer Hinweise über Syntaxfehler, fehlende (optionale) Module für benutzte Funktionen und die Entscheidungen, die Linodef daraufhin getroffen hat. Kritische Nachrichten erscheinen, wenn der Tag nicht ersetzt werden kann, weil Elemente fehlen und Zugriffsnachrichten, weil der Zugriff verweigert wurde.

source: In Linodef Buttons API critical messages appear if the entire button is empty because the entered element is not valid. If it is empty due to access restrictions for the current user then an access message is shown. Furthermore access messages include information about access restriction of a single button item.
de: In der Linodef Schaltflächen API erscheinen kritische Nachrichten, falls die gesamte Schaltfläche leer ist in Folge der Eingabe eines ungültigen Elements. Falls die Schaltfläche wegen einer Zugriffsverweigerung leer ist, so ist dies eine Zugriffsnachricht. Weiterhin erscheinen Zugriffsnachrichten bei Zugriffsverweigerungen für einzelne Listeneinträge.

source: Module !module not enabled!
de: Module !module nicht aktiviert!
