Repository: nadavoid/ReadySiteBase
Catalog: sites/all/modules/roleassign/translations/*.po
Languages: sv

source: Role assign
sv: Rollanvisning

source: Allows site administrators to further delegate the task of managing user's roles.
sv: Ger webbadministratörer möjlighet att delegera rätten att anvisa ett urval roller till andra användare.

source: Roles
sv: Roller

source: Select roles that should be available for assignment.
sv: Välj roller som skall vara tillgängliga för anvisning.

source: create roles
sv: skapa roller

source: Assignable roles
sv: Anvisningsbara roller

source: The user receives the combined permissions of all roles selected here and following roles: %roles.
sv: Användaren får de sammanslagna behörigheterna av alla här valda roller samt följande roller: %roles.

source: Detected malicious attempt to alter user's roles.
sv: Upptäckte uppsåtligt försök att ändra använaders roll.

source: Add a role to the selected users
sv: Lägg till roll till valda användare

source: Remove a role from the selected users
sv: Ta bort roll från valda användare

source: <p>Users with both <code>administer users</code> and <code>assign roles</code> permissions are allowed to assign the roles selected below. For more information, see the !help.</p>
sv: <p>Användare med behörighet att både <code>hantera användare</code> och <code>tilldela roller</code> är tillåtna att anvisa nedan valda roller. För mer inforation se !help.</p>

source: help page
sv: hjälp sida

source: <p>RoleAssign specifically allows site administrators to further delegate the task of managing user's roles.</p> <p>RoleAssign introduces a new permission called <code>assign roles</code>. Users with this permission are able to assign selected roles to still other users. Only users with the <code>administer access control</code> permission may select which roles are available for assignment through this module.</p> <p>This module is sponsored by <a href="http://www.webbredaktoren.se/">Webbredaktören</a>.</p> <!--break--> <h2>Background</h2> <p>It is possible for site administrators to delegate the user administration through the <code>administer users</code> permission. But that doesn't include the right to assign roles to users. That is necessary if the delegatee should be able to administrate user accounts without intervention from a site administrator.</p> <p>To delegate the assignment of roles, site administrators have had until now no other choice than also grant the <code>administer access control</code> permission. But that is not advisable, since it gives right to access all roles, and worse, to grant any rights to any role. That can be abused by the delegatee, who can assign himself all rights and thereby take control over the site.</p> <p>This module solves this dilemma by introducing the <code>assign roles</code> permission. While editing a user's account information, a user with this permission will be able to select roles for the user from a set of available roles. Roles available are configured by users with the <code>administer access control</code> permission.</p> <h2>Install</h2> <ol> <li>Copy the entire <kbd>roleassign</kbd> directory, containing the <kbd>roleassign.module</kbd> and other files, to your Drupal modules directory.</li> <li>Log in as site administrator.</li> <li>Go to the administration page for modules and enable the module.</li> </ol> <h2>Configuration</h2> <ol> <li>Log in as site administrator.</li> <li>Go to the administration page for access control and grant <code>assign roles</code> permission to those roles that should be able to assign roles to other users. Notice that besides the <code>assign roles</code> permission, these roles also must have the <code>administer users</code> permission.</li> <li>Go to the administration page for role assign and select those roles that should be available for assignment by users with <code>assign roles</code> permission.</li> <li>For each user that should be able to assign roles, go to the user's account and select a role with both the <code>assign roles</code> and the <code>administer users</code> permissions.</li> </ol> <h2>Usage</h2> <ol> <li>Log in as a user with both the <code>assign roles</code> and the <code>administer users</code> permissions.</li> <li>To change the roles of a user, go to the user's account and review the assignable roles and change them as necessary.</li> </ol> <h2>License</h2> <p>RoleAssign revision !version. Copyright &copy; !year <a href="mailto:thomas@webbredaktoren.se">Thomas Barregren</a>.</p> <p>RoleAssign is free software; you can redistribute it and/or modify it under the terms of the <a href="http://www.gnu.org/licenses/gpl.html#SEC1">GNU General Public License</a> as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.</p> <p>RoleAssign is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the <a href="http://www.gnu.org/licenses/gpl.html#SEC1">GNU General Public License</a> for more details.</p> <p>You should have received a copy of the <a href="http://www.gnu.org/licenses/gpl.html#SEC1">GNU General Public License</a> along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.</p>
sv: <p>RoleAssign ger webbadministratörer möjlighet att delegera rätten att anvisa ett urval roller till andra användare.</p> <p>RoleAssign introducerar en ny behörighet kallad <code>anvisa roller</code>. Användare med denna behörighet har möjlighet att anvisa utvalda roller till ytterligare andra användare. Endast användare med behörighet att <code>administrera åtkomstkontroll</code> kan konfigurera vilka roller som skall vara tillgängliga genom denna modul.</p> <p>Denna modul sponsras av <a href="http://www.webbredaktoren.se/">Webbredaktören</a>.</p> <!--break--><h2>Bakgrund</h2> <p>Det är möjligt för webbadministratörer att delegera administrationen av användare genom att ge dem behörighet att <code>hantera användare</code>. Men detta inkluderar inte rätten att anvisa roller till användare. Detta är nödvändigt om den befullmäktigade skall kunna administrera användarkonton utan inblandning av en webbadministratör.</p> <p>För att kunna delegera anvisning av roller har webbadministratörer tills nu inte haft annat val än att bevilja användaren behörighet att också <code>administrera åtkomstkontroll</code>. Men det är inte tillrådligt, eftersom det ger rättighet att anvisa alla roller, och värre, att bevilja vilka rättigheter som helst till vilka roller som helst. Det kan missbrukas av den befullmäktigade, som kan ge sig själv alla rättigheter och därigenom ta kontroll över webbplatsen.</p> <p>Denna modul löser detta problem genom att introducera behörighet att <code>anvisa roller</code>. Medan en användare med denna behörihet redigerar ett användarkonto kan hon anvisa roller åt användaren från ett urval av tillgängliga roller. Roller som är tillgängliga är konfigurerade av användare med behörighet att <code>administrera åtkomstkontroll</code>.</p> <h2>Installera</h2> <ol> <li>Kopiera hela <kbd>roleassign</kbd> mappen, som innehåller <kbd>roleassign.module</kbd> och andra filer, till mappen med Drupals moduler.</li> <li>Logga in som webbadministratör.</li> <li>Gå till administrationssidan för moduler och slå på modulen.</li> </ol> <h2>Konfiguration</h2> <ol> <li>Logga in som webbadministratör.</li> <li>Gå till administrationssidan för åtkomstkontroll och bevilja behörighet att <code>anvisa roller</code> till de roller som skall ha möjlighet att anvisa roller till andra användare. Observera att förutom behörighet att <code>anvisa roller</code> så måste dessa roller också ha behörighet att <code>hantera användare</code>.</li> <li>Gå till administrationssidan för roll anvisning och välj de roller som skall vara tillgängliga för användare med behörighet att <code>anvisa roller</code>.</li> <li>För varje användare som skall skall kunna anvisa roller, gå till dennes konto och välj en roll med behörighet att både <code>anvisa roller</code> och att <code>hantera användare</code>.</li> </ol> <h2>Användning</h2> <ol> <li>Logga in som användare med behörighet både att <code>anvisa roller</code> och att <code>hantera användare</code>.</li> <li>För att ändra roller för en användare, gå till dennes användarkonto och gå igenom de anvisade rollerna och ändra där så är erforderligt.</li> </ol> <h2>Licens</h2> <p>RoleAssign revision !version. Copyright &copy; !year <a href="mailto:thomas@webbredaktoren.se">Thomas Barregren</a>.</p> <p>RoleAssign is free software; you can redistribute it and/or modify it under the terms of the <a href="http://www.gnu.org/licenses/gpl.html#SEC1">GNU General Public License</a> as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.</p> <p>RoleAssign is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the <a href="http://www.gnu.org/licenses/gpl.html#SEC1">GNU General Public License</a> for more details.</p> <p>You should have received a copy of the <a href="http://www.gnu.org/licenses/gpl.html#SEC1">GNU General Public License</a> along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.</p>

source: security
sv: säkerhet
