Repository: nadavoid/ReadySiteBase
Catalog: sites/all/modules/linodef/modules/linodef_buttonsapi/translations/linodef_buttonsapi.*.po
Languages: de

source: Submit
de: Speichern

source: Enter or select a tag that you want to include into your text.
de: Den Tag, der in den Text eingefügt werden soll, eingeben oder auswählen.

source: Tag %tag is not valid or not part of this button. Either select another tag from the autocomplete list, use a different editor button or paste the tag you have entered manually into your text.
de: Der Tag %tag ist nicht gültig oder nicht Teil dieser Schaltfläche. Entweder einen anderen Tag aus der Auswahlliste der Autovervollständigung wählen, eine andere Editorschaltfläche benutzen oder den eingegebenen Tag manuell in den Text einfügen.

source: The tag %tag has been submitted. In case it doesn't appear in your text don't worry but manually copy & paste the tag.
de: Der Tag %tag wurde übertragen. Falls er noch nicht im Text aufgetaucht ist, den Tag per Hand in den Text kopieren.

source: Linodef autocomplete popup
de: Linodef Autovervollständigungspopup

source: Linodef autocomplete
de: Linodef Autovervollständigung

source: Linodef Buttons API
de: Linodef Schaltflächen API

source: Retrieve the data to create buttons for Linodef tags and provides popup windows and autocomplete buttons for Linodef editor support modules.
de: Ermittelt die benötigten Daten für Schaltflächen, die Linodef tags nutzen und stellt Popup Fenster sowie Autvervollständigung für die Linodef Editormodule bereit.

source: field
de: Feld

source: fields
de: Felder

source: Reference fields are not supported.
de: Referenzfelder werden nicht unterstützt.

source: Instead of this fieldname the usage of a content type is recommended
de: Statt der Nutzung dieses Feldnames wird die Benutzung eines Inhaltstypen empfohlen

source: or is an unsupported field type.
de: oder ist eine nicht unterstützte Feldart

source: content type
de: Inhaltstyp

source: vocabulary
de: Vokabular

source: terms
de: Begriffe

source: Linodef buttons
de: Linodef Schaltflächen

source: Include default comments into Linodef tags
de: Einfügen standardmäßiger Kommentare in Linodef Tags

source: If enabled, the buttons will include default comments into the Linodef tags. For nodes and fields the node title is used as comment, for taxonomy terms the term name is used.
de: Wenn aktiviert, werden die Schaltflächen Standardkommentare in die Linodef Tags einfügen. Bei Nodes und Felder wird der Nodetitel als Kommentar verwendet, bei Taxonomiebegriffen wird der Begriffsname genutzt.

source: Item sort type & sequence for buttons
de: Sortierungsart & -richtung der Listeneinträge in den Schaltflächen

source: Buttons with field content
de: Schaltflächen mit Feldinhalten

source: Sort by
de: Sortieren nach

source: field ID
de: Feld ID

source: Select a method by which the field content should be sorted.
de: Eine Methode auswählen, nach der die Feldinhalte sortiert werden sollen.

source: Sort sequence
de: Sortierungsrichtung

source: Ascending
de: Aufsteigend

source: Descending
de: Absteigend

source: Buttons with node titles
de: Schaltflächen mit Nodetiteln

source: node title
de: Nodetitel

source: node creation time
de: Erstellungszeit des Nodes

source: time of the last node update
de: Zeitpunkt des letzten Nodeupdate

source: Select a method by which the node titles should be sorted.
de: Eine Methode auswählen, nach der die Nodetitel sortiert werden sollen.

source: This window helps you to retrieve the Linodef tags for embedding %elementtype of the %elementinput.
de: Dieses Fenster hilft beim Ermitteln der Linodef Tags, um %elementtype des %elementinput einzubinden.

source: Click on a list item in the list below to include the corresponding tag into your text.
de: Auf einen untenstehenden Listeneintrag klicken um den zugehörigen Tag in den Texte einzufügen.

source: Enter letters or words that are part of the text you are searching for into the textbox below. After some moments a list of suggestions appears. Choose the desired one so the corresponding tag shows up in the textbox. To submit the tag to your text press "Return" or copy & paste it by hand.
de: In das unten befindliche Textfeld Buchstaben oder Wörter eingeben, die Teil des gesuchten Textes sind. Nach wenigen Sekunden erscheint eine Liste mit Vorschlägen. Aus diesen den gewünschten Eintrag wählen, so dass der zugehörige Tag im Textfeld angezeigt wird. Um den Tag zu übertragen, die "Return" Taste drücken oder per Hand kopieren & einfügen.

source: The tags include the following options:
de: Die Tags beinhalten die folgenden Optionen:

source: Close window
de: Fenster schließen
